<a href="https://colab.research.google.com/github/aejin1211/SOLUX_summer_data/blob/master/1%2C2%EC%A3%BC%EC%B0%A8/Pandas_data_basic_1_14(2020_7_20_8_3).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#1

In [ ]:
### pandas는 파이썬 라이브러리

In [ ]:
### data_frame은 2D array이다. 프로그램을 만들기 위해 엑셀이 아닌 pandas 이용

In [ ]:
### 그리고 pandas는 numpy를 쓰고 있기 때문에 숫자를 다루기에 용이하다.

In [ ]:
### data frame에서 column들은 series로 구성되어 있다.

In [ ]:
### series는 파이썬 list를 이용한다.

##2 - 데이터를 파일에서 불러오는 방법

In [ ]:
###2 - 데이터를 파일에서 불러오는 방법

In [ ]:
 import pandas as pd ### 앞으로 pandas를 pd로

In [ ]:
### data_frame = pd.read_csv('friend_list.csv') - jupyter에서 이용할 시
##이때 friend_list.csv가 jupyter의 main에 존재해야 함.

In [ ]:
## df.head()는 처음부터 5개까지의 데이터를 보여준다. 파라미터에 2를 넣어주면 위에서 2개만 보여줌

In [ ]:
### 뒤에서부터 보고 싶으면 df.tail()이라고 해주면 된다.

In [ ]:
### data_frame = pd.read_csv('friend_list.txt') , txt파일일 경우에 csv는 쉼표로 구분

In [ ]:
## 근데 쉼표가 아닌 tap으로 구분되어 있을 경우에는 data_frame = pd.read_csv('friend_list.csv',delimiter = '\t')

In [ ]:
## 만약 파일 안에 column name에 대한 정보가 없고 단순히 데이터만 들어있을 경우

In [ ]:
## 이를 지정해 줄 때

In [ ]:
## 파라미터 안에 header = None을 추가해주면 column 이름 부분에 숫자가 대신 표현된다.

In [ ]:
## df.columns = ['name', 'job'] , 이름을 지정해 줌

In [ ]:
## 근데 이를 한번에 처리하고 싶으면

In [ ]:
## 파라미터 안에 header = None, names = ['name','job'] 이라고 해주면 된다.

##3 - Create DataFrame from your python code

In [ ]:
##3 - Create DataFrame from your python code

In [ ]:
import pandas as pd

In [ ]:
 friend_dict_list = [
     {'name' : 'John', 'age' : 25, 'job' : 'student'},
      {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
 ]

In [ ]:
## 26, list와 dict으로 데이터 생성

In [ ]:
df = pd.DataFrame(friend_dict_list)

In [ ]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
## 28, dict 같은 경우에는 키의 순서가 보장이 안될 수도 있다. 그래서 다시 column name을 조정

In [ ]:
df = df[['job','name','age']]

In [ ]:
df.head()

       job  name  age
0  student  John   25
1  teacher  Nate   30

In [ ]:
df = df[['name','age','job']]

In [ ]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
## 지정하는 것을 한번에 하고 싶으면 python에서 지원하는 OrderedDict 이용

In [ ]:
from collections import OrderedDict  ## OrderedDict은 키의 순서를 보장해 줌

In [ ]:
friend_ordered_dict = OrderedDict(
[
('name',['John','Nate']),
    ('age',[25,30]),
    ('job',['student','teacher'])
]
)

In [ ]:
##OrderedDict 안에 list, list안에 OrderedDict 여러 개

In [ ]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [ ]:
##  OrderedDict을 이용한 것을 dataframe으로 만들어 줌,

In [ ]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]  ## 이번에는 list를 이용해 dataframe 만드는 법

In [ ]:
## 추가로 column head 정보를 만들어 주어야 한다.

In [ ]:
column_name = ['name','age','job']

In [ ]:
## friend_list 와 column_name 을 이용해서 dataframe을 만든다.

In [ ]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [ ]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
## 만약에 이를 한번에 처리하고 싶으면

In [ ]:
friend_list = [
    ['name',['Jhon','Nate']],
      ['age',[20,30]],
      ['job',['student','teacher']]
]

In [ ]:
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [ ]:
df.head()

   name  age      job
0  Jhon   20  student
1  Nate   30  teacher

##4 - Write DataFrame To File , dataframe을 파일에 저장하는 방법

In [ ]:
import pandas as pd

In [ ]:
friends = [{'name' : 'Jone', 'age' : 20, 'job' : 'student'},
          {'name' : 'Jenny','age' : 30, 'job' : None},
           {'name' : 'Nate','age' : 30, 'job' : 'teacher'}]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]

In [ ]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [ ]:
df.to_csv('friends.csv') ## 파라미터 안에는 디폴트 값으로 index = True, header = True

In [ ]:
## csv파일로 저장

In [ ]:
## None은 빈값(빈칸)으로 저장된다. 근데 이 빈칸을 -라고 표현해주고 싶으면
## 파라미터 안에 na_rep = '-'를 넣어주면 된다.

## 5 - Pandas - Select, Filter Rows or Columns

In [ ]:
import pandas as pd

In [ ]:
from collections import OrderedDict

In [ ]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[1:3] ## index를 이용해서 해당 row에 접근, 마지막 index는 포함하지 않는다.

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
##우리의 결과값이 아직 df에 저장되지 않았다.

In [ ]:
df = df[1:3] ## 결과 값 저장

In [ ]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.loc[[0,2]] ## 불연속적인 데이터 값을 원할 때(ex, index 0,3), 이때 loc함수 이용

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
df = df.loc[[0,2]]  ## dataframe에 적용

In [ ]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
## column의 condition에 따라 row를 선택하는 방법 
## ex, 나이가 25이상의 사람만 원한다.

In [ ]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.query('age>25')  ## 위와 같은 결과값을 내는 또 다른 방법

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[(df.age>25) & (df.name == 'Nate')] 
## 나이가 25이상이고 이름이 Nate인 사람만 불러올 때

   name  age      job
2  Nate   30  teacher

In [ ]:
## column을 filter하는 방법

In [ ]:
# by index

In [ ]:
friend_list = [
    ['John',20, 'student'],
    ['Jenny',30, 'developer'],
    ['Nate',30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [ ]:
 df.iloc[:,0:2]  
 ## column에 있는 index 이용해서 filter 처리하는 방법, iloc함수 이용
 ## , 앞에는 row에 해당, 모든 row를 원하니깐 : 만 표시
 ## , 뒤에는 column에 해당

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [ ]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [ ]:
## column의 이름으로  filter하는 방법

In [ ]:
##df = pd.read_csv('friend_list_no_head.csv',header = None, names = ['name','age','job'])

In [ ]:
## 위의 코드는 jupyter에서 이용 ,해당 파일은 home에 저장해 둠

In [ ]:
##df_filtered = df[['name','age']]

In [ ]:
##df_filtered

In [ ]:
## 위의 4개 코드를 실행하면 column에서 name과 age에만 해당하는 데이터가 보여진다.

In [ ]:
## df.filter(items = ['age','job']), 이번에는 filter라는 함수 이용

In [ ]:
## df.filter(like = 'a', axis = 1 ) ,column name에 a가 들어가는 것만 filter
## axis = 1을 통해 column의 name의 a라는 것을 알 수 있다.

In [ ]:
## df.filter(regex = 'b$', axis = 1) , column name이 b로 끝나는 것만 filter

##6 -Drop row or column

In [ ]:
import pandas as pd

In [ ]:
friends = [{'age' : 15,'job' : 'student'},
          {'age' : 25, 'job' : 'developer'},
          {'age' : 30, 'job' : 'teacher'}]
df = pd.DataFrame(friends,
                 index = ['John','Jenny','Nate'],
                 columns = ['age', 'job'])

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [ ]:
df.drop(['John','Nate'])  ## drop을 이용해 원하는 정보 삭제

       age        job
Jenny   25  developer

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [ ]:
df = df.drop(['John','Nate']) ## 해당 수정된 정보를 저장

In [ ]:
df

       age        job
Jenny   25  developer

In [ ]:
df = pd.DataFrame(friends,
                 index = ['John','Jenny','Nate'],
                 columns = ['age', 'job'])

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [ ]:
df.drop(['John','Nate'],inplace = True)

In [ ]:
## inplace를 통해 따로 assign 해주지 않아도 된다. assign까지 한꺼번에 처리할 수 있다.

In [ ]:
df

       age        job
Jenny   25  developer

In [ ]:
friends = [{'name' : 'John', 'age' : 15,'job' : 'student'},
          {'name' : 'Ben','age' : 25, 'job' : 'developer'},
          {'name' : 'Jenny', 'age' : 30, 'job' : 'teacher'}]
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
## 행에는 0,1,2 index가 들어가 있고, name이 하나의 정보가 됨.

In [ ]:
## 전에는 이름을 통해 데이터를 삭제했는데 이번에는 index를 통해 데이터 삭제

In [ ]:
df = df.drop(df.index[[0,2]])  ## John과 Jenny를 삭제해줌

In [ ]:
df

  name  age        job
1  Ben   25  developer

In [ ]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
## 조건에 따라 삭제하는 방법

In [ ]:
## column의 value에 따라(조건, ex, 나이가 20살 이상)

In [ ]:
df = df[df.age > 20]

In [ ]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
## column을 drop하는 방법 (ex,age column을 없앰)

In [ ]:
df = df.drop('age', axis = 1)  ## axis = 1을 통해 column에 있는 age라는 것을 알 수 있음

In [ ]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [ ]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [ ]:
df.drop('age', axis = 1,inplace = True)

In [ ]:
## 따로 assign 안하고 한번에 처리

In [ ]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

##7- row,column,create,update

In [ ]:
import pandas as pd

In [ ]:
friend_dict_list = [
    {'name':'Jone','age':15,'job':'student'},
     {'name':'Jenny','age':30,'job':'developer'},
     {'name':'Nate','age':30,'job':'teacher'}
]
df = pd.DataFrame(friend_dict_list,columns = ['name','age','job'])

In [ ]:
df.head()

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df['salary'] = 0 ## salary라는 열을 새로 추가, 값은 0으로

In [ ]:
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [ ]:
import numpy as np

In [ ]:
## 학생이면 연봉이 없고 학생이 아닌 직업은 연봉이 있도록 조건을 달아 데이터를 
## 처리하기 위해 numpy 이용

In [ ]:
df['salary'] = np.where(df['job'] != 'student','yes','no')

In [ ]:
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [ ]:
friend_dict_list = [
    {'name':'Jone','midterm':95,'final':85},
     {'name':'Jenny','midterm':85,'final':80},
     {'name':'Nate','midterm':30,'final':10}
]
df = pd.DataFrame(friend_dict_list,columns = ['name','midterm','final'])

In [ ]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [ ]:
df['total'] = df['midterm'] + df['final'] ## total이라는 변수를 추가

In [ ]:
df.head()

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [ ]:
df['average'] = df['total'] / 2

In [ ]:
df.head()

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [ ]:
## grade를 위해 list를 이용

In [ ]:
grades = []
for row in df['average']:   ## average의 행(index) 0,1,2를 각각 받는다.
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
        
df['grade'] = grades

In [ ]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [ ]:
grades

['A', 'B', 'F']

In [ ]:
def pass_or_fail(row): ## pandas의 apply이용하기 위해 함수를 정의한 것
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [ ]:
df.grade = df.grade.apply(pass_or_fail) ## apply를 이용해 pass_or_fail이란 함수 적용

In [ ]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [ ]:
data_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
     {
        'yyyy-mm-dd' : '2007-10-27'
    }
    
]
df = pd.DataFrame(data_list, columns = ['yyyy-mm-dd'])

In [ ]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [ ]:
def extract_year(row):
    return row.split('-')[0] 
## 년도만 따로 빼주기 위해 함수 정의
## -로 구분을 해주는데 첫번째 인자를 원하니 index는 0이다.

In [ ]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [ ]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [ ]:
friend_dict_list = [
    {'name':'Jone','midterm':95,'final':85},
     {'name':'Jenny','midterm':85,'final':80},
     {'name':'Nate','midterm':30,'final':10}
]

In [ ]:
## 이번에는 행을 생성하는 방법

In [ ]:
df = pd.DataFrame(friend_dict_list,columns = ['name','midterm','final'])

In [ ]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [ ]:
df2 = pd.DataFrame([
    ['Ben',50, 50]
], columns = ['name', 'midterm', 'final'])

In [ ]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [ ]:
df.append(df2, ignore_index = True)  ##원래의 dataframe인 df에 새로 만든 df2를 추가

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50

##8 - Group by

In [ ]:
import pandas as pd

In [ ]:
student_list = [
    {'name' : 'John', 'major' : "Computer Science", 'sex' : "male"},
    {'name' : 'Nate', 'major' : "Computer Science", 'sex' : "male"},
    {'name' : 'Abraham', 'major' : "Physics", 'sex' : "male"},
    {'name' : 'Brian', 'major' : "Psychology", 'sex' : "male"},
    {'name' : 'Janny', 'major' : "Economics", 'sex' : "female"},
    {'name' : 'Yuna', 'major' : "Economics", 'sex' : "female"},
    {'name' : 'Jeniffer', 'major' : "Computer Science", 'sex' : "female"},
    {'name' : 'Edward', 'major' : "Computer Science", 'sex' : "male"},
    {'name' : 'Zara', 'major' : "Psychology", 'sex' : "female"},
    {'name' : 'Wendy', 'major' : "Economics", 'sex' : "female"},
    {'name' : 'Sera', 'major' : "Psychology", 'sex' : "female"}
]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])

In [ ]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [ ]:
groupby_major = df.groupby('major')
## 학과별로 몇명인지 알고 싶을 때 group by 함수를 사용

In [ ]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [ ]:
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [ ]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()})

In [ ]:
df_major_cnt

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [ ]:
## major가 column으로 들어가게 하기 위해 .reset_index()를 추가
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()}).reset_index()

In [ ]:
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [ ]:
groupby_sex = df.groupby('sex')

In [ ]:
for name, group in groupby_sex:
    print(name + " : " + str(len(group)))
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

##9 - drop duplicate

In [ ]:
import pandas as pd

In [ ]:
student_list = [
    {'name' : 'John',
    'major' : "Computer Science",
    'sex' : "male"},
    {'name' : 'Nate',
    'major' : "Computer Science",
    'sex' : "male"},
    {'name' : 'Edward',
    'major' : "Computer Science",
    'sex' : "male"},
    {'name' : 'Zara',
    'major' : "Psychology",
    'sex' : "female"},
    {'name' : 'John',
    'major' : "Computer Science",
    'sex' : "male"}
]
df = pd.DataFrame(student_list, columns = ['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [ ]:
df.duplicated()  ## 어떤게 중복되었는지 알아봄

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [ ]:
## 여기서 true는 중복이라는 것을 의미한다.

In [ ]:
df.drop_duplicates()  ## 중복된 것을 제거

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [ ]:
## 근데 보통은 모든 데이터가 같은 것을 중복이라고 해서 제거하는 것이 아니라
## 이름이 같은 것을 제거하는 등 이런 조건인 경우가 많음

In [ ]:
student_list = [
    {'name' : 'John',
    'major' : "Computer Science",
    'sex' : "male"},
    {'name' : 'Nate',
    'major' : "Computer Science",
    'sex' : "male"},
    {'name' : 'Edward',
    'major' : "Computer Science",
    'sex' : "male"},
    {'name' : 'Zara',
    'major' : "Psychology",
    'sex' : "female"},
    {'name' : 'Wendy',
    'major' : "Economics",
    'sex' : "female"},
    {'name' : 'Nate',
    'major' : None,
    'sex' : "male"},
    {'name' : 'John',
    'major' : "Economics",
    'sex' : "male"}
]
df = pd.DataFrame(student_list, columns = ['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [ ]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [ ]:
## 여기서는 모든 데이터가 같은 값들이 없기 때문에 true가 안나온다.

In [ ]:
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [ ]:
## 이번에는 name을 가지고 판단하였기 때문에 5,6에 name이 중복되기 때문에 true가 나온다.

In [ ]:
df.drop_duplicates(['name'], keep = 'first')
##지우려고 하는 항목은 name
##앞에 있는 것을 유지(default 값은 first이다.)
## 뒤에 있는 것을 유지하고싶으면 first 대신 last를 넣어준다.

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female

##10 - NaN을 찾고 원하는 값으로 변경하기

In [ ]:
import pandas as pd

In [ ]:
school_id_list = [
    {'name' : 'John', 'job' : "teacher" , 'age' : 40},
    {'name' : 'Nate', 'job' : "teacher" , 'age' : 35},
    {'name' : 'Yuna', 'job' : "teacher" , 'age' : 37},
    {'name' : 'Abraham', 'job' : "student" , 'age' : 10},
    {'name' : 'Brian', 'job' : "student" , 'age' : 12},
    {'name' : 'Janny', 'job' : "student" , 'age' : 11},
    {'name' : 'Nate', 'job' : "teacher" , 'age' : None},
    {'name' : 'John', 'job' : "student" , 'age' : None}
]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
## NaN은 None value를 의미한다.

In [ ]:
df.shape

(8, 3)

In [ ]:
## 8개의 row, 3개의 column

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [ ]:
## df.info에서 6 non-null을 통해 2개의 none 값을 확인할 수 있다.

In [ ]:
 df.isna() ## non-value를 확인할 수 있는 또 다른 방법

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
## true가 none 값이다.

In [ ]:
df.isnull() ## true가 none 값이다.

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
df.age = df.age.fillna(0)  ## none 값을 0으로 바꿈

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [ ]:
## 근데 보통 null 값은 그럴싸한 값으로 바꿔주는 경우가 많음

In [ ]:
school_id_list = [
    {'name' : 'John', 'job' : "teacher" , 'age' : 40},
    {'name' : 'Nate', 'job' : "teacher" , 'age' : 35},
    {'name' : 'Yuna', 'job' : "teacher" , 'age' : 37},
    {'name' : 'Abraham', 'job' : "student" , 'age' : 10},
    {'name' : 'Brian', 'job' : "student" , 'age' : 12},
    {'name' : 'Janny', 'job' : "student" , 'age' : 11},
    {'name' : 'Nate', 'job' : "teacher" , 'age' : None},
    {'name' : 'John', 'job' : "student" , 'age' : None}
]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)

In [ ]:
## job을 기준으로 나누고 그 중 age의 median값으로 변경

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

##12 - Apply

In [1]:
import pandas as pd

In [2]:
data_list = [{'yyyy-mm-dd' : '2000-06-27'},
             {'yyyy-mm-dd' : '2002-09-24'},
             {'yyyy-mm-dd' : '2005-12-20'}]
df = pd.DataFrame(data_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [3]:
## 현재 column이 한개만 존재하는데 apply func을 이용해서 column을 추가

In [4]:
def extract_year(column):
    return column.split("-")[0]

In [5]:
## 하나의 column을 받았을 때, -로 구분해서 index 0번째 것을 가져온다.

In [6]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [7]:
 ##  df['yyyy-mm-dd']를 통해 for문을 쓰지 않고도 모든 row의 값들을 대입

In [8]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [9]:
def get_age(year, current_year):
    return current_year - int(year)

In [11]:
## apply안에 파라미터를 집어넣는 방법
## 여기서는 current_year를 받는다.

In [12]:
df['age'] = df['year'].apply(get_age, current_year = 2018)

In [13]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [14]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [15]:
df['introduce'] = df['age'].apply(get_introduce, prefix = "I am", suffix = "years old")

In [16]:
## apply안에 함수를 넣고 그 다음에 파라미터를 넣어준다.

In [17]:
df

   yyyy-mm-dd  year  age        introduce
0  2000-06-27  2000   18  I am18years old
1  2002-09-24  2002   16  I am16years old
2  2005-12-20  2005   13  I am13years old

In [18]:
## 여러 개의 column을 apply하는 방법

In [19]:
def get_introduce2(row):
    return "I was born in "+str(row.year)+" my age is " + str(row.age)

In [20]:
df.introduce = df.apply(get_introduce2, axis = 1)

In [21]:
## axis = 1 을 하면 row에 있는 모든 column들을 활용 가능

In [22]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

In [23]:
df.introduce = df.apply(get_introduce2, axis = 1) ## 이 코드와

In [24]:
df['introduce'] = df.apply(get_introduce2, axis = 1) ## 이 코드는 서로 같다.

##12 - map, applymap

In [25]:
import pandas as pd

In [26]:
data_list = [{'date' : '2000-06-27'},
             {'date' : '2002-09-24'},
             {'date' : '2005-12-20'}]
df = pd.DataFrame(data_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [27]:
def extract_year(date):
  return date.split('-')[0]

In [29]:
df['year'] = df['date'].map(extract_year)

In [30]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [31]:
## 이전의 apply와 사용하는 방법이 같음

In [33]:
job_list = [{'age' : 20, 'job':'student'},
            {'age' : 30, 'job' : 'developer'},
            {'age': 30, 'job' : 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [34]:
## 머신러닝을 하다보면 student, developer, teacher와 같은 텍스트를
## 숫자로 바꿔주어야 할 때가 있다. 이때 map을 이용

In [35]:
df.job = df.job.map({'student' : 1, "developer" : 2, "teacher" : 3})

In [36]:
df

   age  job
0   20    1
1   30    2
2   30    3

In [37]:
x_y = [{'x' : 5.5, 'y' : -5.6, 'z' : -1.1},
       {'x' : -5.2, 'y' : 5.5, 'z' : -2.2},
       {'x' : -1.6, 'y' : -4.5, 'z' : -3.3}
       ]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [38]:
## 하나의 column이 아닌 모든 column에 적용하고 싶을 때 applymap을 사용

In [39]:
import numpy as np

In [40]:
df = df.applymap(np.around)

In [41]:
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

##13 - unique값을 뽑아내고 get

In [42]:
import pandas as pd

In [45]:
job_list = [{'name' : 'John', 'job' : "teacher"},
            {'name' : 'Nate', 'job' : "teacher"},
            {'name' : 'Fred', 'job' : "teacher"},
            {'name' : 'Abraham', 'job' : "student"},
            {'name' : 'Brian','job' : "student"},
            {'name' : 'Jenny', 'job' : "developer"},
            {'name' : 'Nate', 'job' : "teacher"},
            {'name' : 'Ian', 'job' : "teacher"},
            {'name' : 'Chris', 'job' : "banker"},
            {'name' : 'Fhilip', 'job' : "lawyer"},
            {'name' : 'Jenny', 'job' : "basketball player"},
             {'name' : 'Gwen', 'job' : "teacher"},
             {'name' : 'Jessy', 'job' : "student"}
            ]
df = pd.DataFrame(job_list, columns = ['name' , 'job'])

In [46]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Jenny          developer
6      Nate            teacher
7       Ian            teacher
8     Chris             banker
9    Fhilip             lawyer
10    Jenny  basketball player
11     Gwen            teacher
12    Jessy            student

In [47]:
df.job.unique() ## 여기서 job은 column이름

array(['teacher', 'student', 'developer', 'banker', 'lawyer',
       'basketball player'], dtype=object)

In [48]:
## student가 여러개 있어서 하나만 나온다.

In [49]:
## 각 직업별로 몇개의 데이터가 있는지 보고 싶으면

In [50]:
df.job.value_counts()

teacher              6
student              3
banker               1
lawyer               1
basketball player    1
developer            1
Name: job, dtype: int64

##14 - concatenate two dataframes

In [51]:
import pandas as pd

In [52]:
l1 = [{'name' : 'John', 'job':"teacher"},
      {'name' : 'Nate', 'job':"student"},
      {'name' : 'Fred', 'job':"developer"}
      ]
l2 = [{'name' : 'Ed', 'job':"dentist"},
      {'name' : 'Jack', 'job':"farmer"},
      {'name' : 'Ted', 'job':"designer"}
      ]
l3 = [{'name' : 'John', 'job':"teacher"},
      {'name' : 'Nate', 'job':"student"},
      {'name' : 'Jack', 'job':"developer"}
      ]
l4 = [{'age' : 25, 'country':"U.S"},
      {'age' : 30, 'country':"U.K"},
      {'age' : 45, 'country':"Korea"}
      ]

In [53]:
## 두개의 데이터프레임을 합치는 방법

In [54]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [55]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [56]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [57]:
## column(name, job)이 서로 같으니깐 row로 합치는 방법

In [58]:
result = pd.concat([df1, df2])

In [59]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [60]:
## 하지만 index가 똑같이 들어갔다.

In [61]:
result = pd.concat([df1, df2], ignore_index = True)

In [62]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [63]:
result = df1.append(df2)

In [64]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [65]:
result = df1.append(df2, ignore_index = True)

In [66]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [67]:
## 이번에는 열로 합치는 방법

In [68]:
df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])

In [69]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [70]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [71]:
result = pd.concat([df1,df2], axis = 1, ignore_index = True)

In [72]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

In [73]:
## 이번에는 dataframe이 아닌 list로 합치는 방법

In [74]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [77]:
comparison = pd.DataFrame({'label': label, 'prediction' : prediction})

In [78]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4